# Insulation Material Create Method

Source: https://www.revitapidocs.com/2026/10b01e45-f9b9-1fef-8efb-d91b0dd5f093.htm

---

| Insulation Material Create Method |
| --- |

Creates a Conductor Insulation Material.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static InsulationMaterial Create(
	Document document
)
```

```
Public Shared Function Create (
	document As Document
) As InsulationMaterial
```

```
public:
static InsulationMaterial^ Create(
	Document^ document
)
```

```
static member Create :
        document : Document -> InsulationMaterial
```

#### Parameters

document Document
:   The document.

#### Return Value

InsulationMaterial
The newly created Conductor Insulation Material data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| ModificationForbiddenException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements).  \-or\-  The document is being loaded, or is in the midst of another  sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

See Also

#### Reference

InsulationMaterial Class Autodesk.Revit.DB.Electrical Namespace